---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPattern
source: html/1d8b109e-c916-80fd-f41b-04c9deeccddd.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPattern Property

Accesses the object containing properties related to the baluster pattern.

## Syntax (C#)
```csharp
public BalusterPattern BalusterPattern { get; }
```